app/views/mappingjobposition/index.php

SELECT * FROM `mastersubjobfamily` WHERE `id`=25
SELECT * FROM `mastersubjobfamily`
---
                [
                    'attribute' => 'subjobfamilyid',
                    'format' => 'html',
                    'filter' => \kartik\select2\Select2::widget([
                        'model' => $searchModel,
                        'attribute' => 'subjobfamilyid',
                        'data' => ArrayHelper::map(Mastersubjobfamily::find()->asArray()->all(), 'id', 'subjobfamily'),
                        'options' => ['placeholder' => '--'],
                        'pluginOptions' => [
                            'allowClear' => true,
                        ],
                    ]),

SELECT * FROM `trans_rincian_rekrut`
---
                [
                    'attribute' => 'jabatansap',
                    'format' => 'html',
                    'filter' => \kartik\select2\Select2::widget([
                        'model' => $searchModel,
                        'attribute' => 'jabatansap',
                        'data' => ArrayHelper::map(Transrincianrekrut::find()->asArray()->all(), 'id', 'jabatan_sap'),
                        'options' => ['placeholder' => '--'],
                        'pluginOptions' => [
                            'allowClear' => true,
                        ],
                    ]),

SELECT * FROM `trans_rincian_rekrut` WHERE `id`='14183'
SELECT * FROM `trans_rincian_rekrut`
---
                    }

                ],
                [
                    'attribute' => 'kodeposisi',
                    'format' => 'html',
                    'filter' => \kartik\select2\Select2::widget([
                        'model' => $searchModel,
                        'attribute' => 'kodeposisi',
                        'data' => ArrayHelper::map(Transrincianrekrut::find()->asArray()->all(), 'id', 'hire_jabatan_sap'),
                        'options' => ['placeholder' => '--'],
                        'pluginOptions' => [
                            'allowClear' => true,
                        ],
                    ]),
                    'value' => function ($data) {
                        return ($data->masterkodeposisi) ? $data->masterkodeposisi->hire_jabatan_sap : '';
                    }

                ],