app/components/checkComponent.php

    public function cuserprofile($userid){
        $ret = null;
        $userprofile = Userprofile::find()->where(['userid'=>$userid])->one();
---
SELECT * FROM `userprofile` WHERE `userid` IS NULL