app/components/OauthComponent.php

  public function getuserdata($token)
  {
    $curl = new curl\Curl();
    $getuserdata = $curl->setPostParams([
      'access_token' => $token,
    ])
      ->post('http://passport.ish.co.id/core/api/sso/info');
    $useroauthdata = json_decode($getuserdata);
    // var_dump($useroauthdata);die;
    if ($useroauthdata->code == 1) {
      // var_dump(Yii::$app->getUser());die;
      if ($user =  User::findByUsername($useroauthdata->data->username)) {
        if ($user->access_token == $token) {
          return Yii::$app->user->login($user);
        } else {
          $tokenupdate = Userlogin::findOne($user->id);
          $tokenupdate->auth_key =  $token;
          $tokenupdate->password_hash =  $token;
          $tokenupdate->access_token = $token;
          $tokenupdate->save(false);
---
UPDATE `user` SET `password_hash`='rc2wjl25r7zqrsmtbd0l6rpjd', `auth_key`='rc2wjl25r7zqrsmtbd0l6rpjd', `access_token`='rc2wjl25r7zqrsmtbd0l6rpjd' WHERE `id`=104728