app/components/UtilComponent.php

  public function permission($roleid,$modulecode){

    $ret = false;
    if(!Yii::$app->user->isGuest){
      if($modulecode == "B01" && $roleid == 2){
          $ret = false;
      }else {
        $getgrouprole = Yii::$app->user->identity->grouprolepermissionid;
        $rolepermission = null;
        if($getgrouprole){
          $getroleid = $this->getroleid($getgrouprole);

          // var_dump($getgrouprole);die;
          if($getroleid){
            $getroleid = implode(',', $getroleid);
            $rolepermission = Rolepermission::find()->where('roleid IN (' . $getroleid . ') and modulecode = "'.$modulecode.'"')->one();
          }
        }else{
          $rolepermission = Rolepermission::find()->where(['roleid'=>$roleid,'modulecode'=>$modulecode])->one();
---
SELECT * FROM `rolepermission` WHERE (`roleid`='3') AND (`modulecode`='B01')

    public function create_login_log(){
      $ret = null;
      if(!Yii::$app->user->isGuest){
        $checklog = Logactivity::find()->where('userid ='.Yii::$app->user->identity->id.' AND date = CURDATE()')->one();
---
SELECT * FROM `logactivity` WHERE userid =104728 AND date = CURDATE()