app/config/web.php

        if (!Yii::$app->user->isGuest){
            $session = Yii::$app->session;
            if ($session->isActive){
                $checktoken = Userdata::find()->where(['id'=>Yii::$app->user->identity->id, 'access_token'=>null])->andWhere('role <> 2')->one();
---
SELECT * FROM `user` WHERE ((`id`=104728) AND (`access_token` IS NULL)) AND (role <> 2)