app/views/site/_search.php

    </li>
    <li>
      <?php
      $city = ArrayHelper::map(MappingCity::find()->asArray()->all(), 'city_id', 'city_name');
---
SELECT * FROM `mapping_city`