app/controllers/MappingjobpositionController.php

SELECT * FROM `mappingjobposition` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Mappingjobposition::findOne($id)) !== null) {