app/controllers/MasterjobfamilyController.php

SELECT * FROM `masterjobfamily` WHERE `id`='9'
---
    public function actionDelete($id)
    {
        $jobfamily = Masterjobfamily::find($id)->all();