app/controllers/MastersubjobfamilyController.php

SELECT * FROM `masterjobfamily`
---
    public function actionIndex()
    {
        $jobfamily = Masterjobfamily::find()->all();

SELECT * FROM `masterjobfamily`
SELECT EXISTS(SELECT * FROM `mastersubjobfamily` WHERE `mastersubjobfamily`.`subjobfamily`='11')
INSERT INTO `mastersubjobfamily` (`status`, `jobfamily_id`, `subjobfamily`, `createtime`, `updatetime`) VALUES (0, 7, 'rew', '2022-03-21 13-44-27', '2022-03-21 13-44-27')
---
    public function actionCreate()
    {
        $model = new Mastersubjobfamily();

        $jobfamily = ArrayHelper::map(Masterjobfamily::find()->asArray()->all(), 'id', 'jobfamily');
        if ($model->load(Yii::$app->request->post())) {
            $model->createtime = date('Y-m-d H-i-s');
            $model->updatetime = date('Y-m-d H-i-s');
            $model->status = 1;
            if ($model->save()) {

SELECT * FROM `mastersubjobfamily` WHERE `id`='14'
---
    protected function findModel($id)
    {
        if (($model = Mastersubjobfamily::findOne($id)) !== null) {