app/controllers/MasterindustryController.php

    public function actionCreate()
    {
        $model = new Masterindustry();

        if ($model->load(Yii::$app->request->post())) {
            $model->createtime = date('Y-m-d H-i-s');
            $model->updatetime = date('Y-m-d H-i-s');
            $model->save();
---
INSERT INTO `masterindustry` (`industry_type`, `createtime`, `updatetime`) VALUES ('Test', '2022-03-15 08-07-18', '2022-03-15 08-07-18')