app/controllers/MasterindustryController.php

INSERT INTO `masterindustry` (`industry_type`, `createtime`, `updatetime`, `status`) VALUES ('1', '2022-03-21 23-07-48', '2022-03-21 23-07-48', 1)
---
    public function actionCreate()
    {
        $model = new Masterindustry();

        if ($model->load(Yii::$app->request->post())) {
            $model->createtime = date('Y-m-d H-i-s');
            $model->updatetime = date('Y-m-d H-i-s');
            $model->status = 1;
            if ($model->save()) {

SELECT * FROM `masterindustry` WHERE `id`='14'
---
    protected function findModel($id)
    {
        if (($model = Masterindustry::findOne($id)) !== null) {