app/controllers/MasterSubJobFamilyController.php

SELECT * FROM `mastersubjobfamily` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Mastersubjobfamily::findOne($id)) !== null) {