app/controllers/MasterroomController.php

SELECT * FROM `masteroffice`
---
    public function actionCreate()
    {
        $model = new Masterroom();
        $office = ArrayHelper::map(Masteroffice::find()->asArray()->all(), 'id', 'officename');