app/controllers/MastercityController.php

SELECT * FROM `mastercity` WHERE `provinsiid`='3'
---
    public function actionGetcity() {
      $out = [];
  		if (isset($_POST['depdrop_parents'])) {
  			$parents = $_POST['depdrop_parents'];
        $provinsiid = empty($parents[0]) ? null : $parents[0];
  			$model = Mastercity::find()->asArray()->where(['provinsiid'=>$provinsiid])->all();