app/controllers/ReportController.php

SELECT * FROM `saparea`
SELECT * FROM `sappersonalarea`
SELECT * FROM `sapjob`
SELECT * FROM `masterareaish`
SELECT * FROM `masterregion`
---
  public function actionReporthiring()
  {
    $searchModel = new Hiringreport();
    $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
    $area = ArrayHelper::map(Saparea::find()->asArray()->all(), 'value1', 'value2');
    $parea = ArrayHelper::map(Sappersonalarea::find()->asArray()->all(), 'value1', 'value2');
    $jabatan = ArrayHelper::map(Sapjob::find()->asArray()->all(), 'value1', 'value2');
    $areaish = ArrayHelper::map(Masterareaish::find()->asArray()->all(), 'id', 'area');
    $region = ArrayHelper::map(Masterregion::find()->asArray()->all(), 'id', 'regionname');