app/controllers/SiteController.php

  public function actionIndex()
  {

    //Yii::$app->language = 'id';

    $searchModel = new Transrinciansearch();
    $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
    $this->layout = Yii::$app->utils->getlayout();
    $totaljo  = Transrincian::find()->joinWith("jobfunc")->joinWith("transjo")->where('trans_jo.type_jo <= 2')->andWhere('trans_jo.type_replace = 2')->andWhere('trans_rincian_rekrut.status_rekrut <> 2')->count();
    $joblocation  = Transrincian::find()->joinWith("jobfunc")->joinWith("transjo")->where('trans_jo.type_jo <= 2')->andWhere('trans_jo.type_replace = 2')->andWhere('trans_rincian_rekrut.status_rekrut <> 2')->groupBy(['lokasi'])->count();
    $jobfunction = Transrincian::find()->joinWith("jobfunc")->joinWith("transjo")->where('trans_jo.type_jo <= 2')->andWhere('trans_jo.type_replace = 2')->andWhere('trans_rincian_rekrut.status_rekrut <> 2')->groupBy(['job_function.name_job_function'])->orderby(['id' => SORT_DESC])->limit(8)->all();
    $jobcategory = Masterjobfamily::find()->andWhere('status = 1')->orderby(['jobfamily' => SORT_ASC])->all();
    $totaljocategory  = Transrincian::find()->andWhere('trans_rincian_rekrut.status_rekrut <> 1')->groupBy(['hire_jabatan_sap'])->count();
    $totalapplicant = Userprofile::find()->count();
---
SELECT COUNT(*) FROM `trans_rincian_rekrut` LEFT JOIN `job_function` ON `trans_rincian_rekrut`.`jabatan` = `job_function`.`id` LEFT JOIN `trans_jo` ON `trans_rincian_rekrut`.`nojo` = `trans_jo`.`nojo` WHERE (trans_jo.type_jo <= 2) AND (trans_jo.type_replace = 2) AND (trans_rincian_rekrut.status_rekrut <> 2)
SELECT COUNT(*) FROM (SELECT `trans_rincian_rekrut`.* FROM `trans_rincian_rekrut` LEFT JOIN `job_function` ON `trans_rincian_rekrut`.`jabatan` = `job_function`.`id` LEFT JOIN `trans_jo` ON `trans_rincian_rekrut`.`nojo` = `trans_jo`.`nojo` WHERE (trans_jo.type_jo <= 2) AND (trans_jo.type_replace = 2) AND (trans_rincian_rekrut.status_rekrut <> 2) GROUP BY `lokasi`) `c`
SELECT `trans_rincian_rekrut`.* FROM `trans_rincian_rekrut` LEFT JOIN `job_function` ON `trans_rincian_rekrut`.`jabatan` = `job_function`.`id` LEFT JOIN `trans_jo` ON `trans_rincian_rekrut`.`nojo` = `trans_jo`.`nojo` WHERE (trans_jo.type_jo <= 2) AND (trans_jo.type_replace = 2) AND (trans_rincian_rekrut.status_rekrut <> 2) GROUP BY `job_function`.`name_job_function` ORDER BY `id` DESC LIMIT 8
SELECT COUNT(*) FROM `userprofile`

  public function actionVerifycode()
  {
    $this->layout = Yii::$app->utils->getlayout();
    $id = Yii::$app->user->identity->id;
    // $model = $this->findModel($id);
    $model =  new Userdata();
    $modelsave = Userdata::find()->where(['id' => $id])->one();

    if ($model->load(Yii::$app->request->post())) {
      // var_dump($model->verify_code);die();
      if ($model->verify_code == 'CWLjUrxM') {
        $modelsave->verify_status = 1;
        $modelsave->save(false);
---
SELECT * FROM `user` WHERE `id`=104731
UPDATE `user` SET `verify_status`=1 WHERE `id`=104731

  public function actionDashboard()
  {

    $model = new Transrinciansearch();
    $year = date('Y');
    $model->yeardata = $year;
    $totaljo = Transrincian::find()->joinWith("transjo")->where("trans_rincian_rekrut.skema = 1 and YEAR(trans_jo.tanggal) = '" . $year . "'")->count();
    $totalclosed = Transrincian::find()->joinWith("transjo")->where("trans_rincian_rekrut.skema = 1 and trans_rincian_rekrut.status_rekrut = 2 and YEAR(trans_jo.tanggal) = '" . $year . "'")->count();
    $totalpending = $totaljo - $totalclosed;
    $totalemp = Transrincian::find()->joinWith("transjo")->where("trans_rincian_rekrut.skema = 1 and YEAR(trans_jo.tanggal) = '" . $year . "'")->sum('jumlah');
    $totalempclosed = Transrincian::find()->joinWith("transjo")->where("trans_rincian_rekrut.skema = 1 and trans_rincian_rekrut.status_rekrut = 2 and YEAR(trans_jo.tanggal) = '" . $year . "'")->sum('jumlah');
    $totalemppending = $totalemp - $totalempclosed;
    $totalapplicant = Userprofile::find()->where("YEAR(createtime) = '" . $year . "'")->count();
    // $totalapplicants3 =
    $candidatecount = Recruitmentcandidate::find()->where("YEAR(createtime) = '" . $year . "'")->count();
    $interviewapp = Interview::find()->where("YEAR(createtime) = '" . $year . "'")->count();
    $onintcount = Interview::find()->where("YEAR(createtime) = '" . $year . "'  and (status = 1 OR status = 0)")->count();
    $passintcount = Interview::find()->where("YEAR(createtime) = '" . $year . "'  and status = 2")->count();
    $failintcount = Interview::find()->where("YEAR(createtime) = '" . $year . "'  and status = 3")->count();

    $psikotestapp = Psikotest::find()->where("YEAR(createtime) = '" . $year . "'")->count();
    $onpsicount = Psikotest::find()->where("YEAR(createtime) = '" . $year . "'  and (status = 1 OR status = 0)")->count();
    $passpsicount = Psikotest::find()->where("YEAR(createtime) = '" . $year . "'  and status = 2")->count();
    $failpsicount = Psikotest::find()->where("YEAR(createtime) = '" . $year . "'  and status = 3")->count();

    $uinterviewapp = Userinterview::find()->where("YEAR(createtime) = '" . $year . "'")->count();
    $onuinterviewcount = Userinterview::find()->where("YEAR(createtime) = '" . $year . "'  and (status = 1 OR status = 0)")->count();
    $passuinterviewcount = Userinterview::find()->where("YEAR(createtime) = '" . $year . "'  and status = 2")->count();
    $failuinterviewcount = Userinterview::find()->where("YEAR(createtime) = '" . $year . "'  and status = 3")->count();

    $tsoftskillapp = Tsoftskill::find()->where("YEAR(createtime) = '" . $year . "'")->count();
    $thardskillapp = Thardskill::find()->where("YEAR(createtime) = '" . $year . "'")->count();
    $tpasifapp = Tpasif::find()->where("YEAR(createtime) = '" . $year . "'")->count();
    $taktifapp = Taktif::find()->where("YEAR(createtime) = '" . $year . "'")->count();
    $totalhiring = Hiring::find()->where("YEAR(createtime) = '" . $year . "' and statushiring = 4")->count();
    $totalophiring = Hiring::find()->where("YEAR(createtime) = '" . $year . "' and statushiring <> 4 and statushiring <> 5")->count();

    $totalstopjo = Chagerequestjo::find()->where("YEAR(createtime) = '" . $year . "' and status = 3")->groupBy(['recruitreqid'])->count();
    $datastopjo = Chagerequestjo::find()->where("YEAR(createtime) = '" . $year . "' and status = 3")->groupBy(['recruitreqid'])->all();
---
SELECT COUNT(*) FROM `trans_rincian_rekrut` LEFT JOIN `trans_jo` ON `trans_rincian_rekrut`.`nojo` = `trans_jo`.`nojo` WHERE trans_rincian_rekrut.skema = 1 and trans_rincian_rekrut.status_rekrut = 2 and YEAR(trans_jo.tanggal) = '2022'
SELECT SUM(jumlah) FROM `trans_rincian_rekrut` LEFT JOIN `trans_jo` ON `trans_rincian_rekrut`.`nojo` = `trans_jo`.`nojo` WHERE trans_rincian_rekrut.skema = 1 and trans_rincian_rekrut.status_rekrut = 2 and YEAR(trans_jo.tanggal) = '2022'
SELECT COUNT(*) FROM `userprofile` WHERE YEAR(createtime) = '2022'
SELECT COUNT(*) FROM `recruitmentcandidate` WHERE YEAR(createtime) = '2022'
SELECT COUNT(*) FROM `interview` WHERE YEAR(createtime) = '2022'  and status = 3
SELECT COUNT(*) FROM `psikotest` WHERE YEAR(createtime) = '2022'  and status = 3
SELECT COUNT(*) FROM `userinterview` WHERE YEAR(createtime) = '2022'  and status = 3
SELECT COUNT(*) FROM `tsoftskill` WHERE YEAR(createtime) = '2022'
SELECT COUNT(*) FROM `thardskill` WHERE YEAR(createtime) = '2022'
SELECT COUNT(*) FROM `tpasif` WHERE YEAR(createtime) = '2022'
SELECT COUNT(*) FROM `taktif` WHERE YEAR(createtime) = '2022'
SELECT COUNT(*) FROM `hiring` WHERE YEAR(createtime) = '2022' and statushiring <> 4 and statushiring <> 5
SELECT COUNT(*) FROM (SELECT * FROM `chagerequestjo` WHERE YEAR(createtime) = '2022' and status = 3 GROUP BY `recruitreqid`) `c`
SELECT * FROM `chagerequestjo` WHERE YEAR(createtime) = '2022' and status = 3 GROUP BY `recruitreqid`