app/controllers/UserprofileController.php

    public function actionUpdate($id)
    {
        $this->layout = Yii::$app->utils->getlayout();
        $model = $this->findModel($id);
        $modelvaksin = Uservaksin::find()->where(['userid'=>$model->userid])->one();

        if(!$modelvaksin){
          $modelvaksin = new Uservaksin();
          $modelvaksin->scenario = 'create';

        }else{
          $modelvaksin->scenario = 'update';

        }

        $alasanvaksin = ArrayHelper::map(Masteralasanvaksin::find()->asArray()->all(), 'id', 'alasan');
        $old_filep = $model->photo;
        $old_filecv = $model->cvupload;
        $old_filesert1 = null;
        $old_filesert2 = null;
        if($modelvaksin){
        $old_filesert1 = $modelvaksin->sertvaksin1;
        $old_filesert2 = $modelvaksin->sertvaksin2;
        }
        $province = ArrayHelper::map(MasterProvince::find()->asArray()->all(), 'provinsiid', 'provinsi');
        $kota = ArrayHelper::map(Mastercity::find()->asArray()->where(['kotaid'=>$model->cityid])->all(), 'kotaid', 'kota');
        $provincektp = ArrayHelper::map(MasterProvince::find()->asArray()->all(), 'provinsiid', 'provinsi');
        $kotaktp = ArrayHelper::map(Mastercity::find()->asArray()->where(['kotaid'=>$model->cityidktp])->all(), 'kotaid', 'kota');
---
SELECT * FROM `uservaksin` WHERE `userid`=104729
SELECT * FROM `masteralasanvaksin`
SELECT * FROM `masterprovince`
SELECT * FROM `mastercity` WHERE `kotaid`=163

    protected function findModel($id)
    {
        if (($model = Userprofile::findOne($id)) !== null) {
---
SELECT * FROM `userprofile` WHERE `id`='74214'