app/models/MappingjobpositionSearch.php

SELECT * FROM `mappingjobposition` GROUP BY `jabatansap`
SELECT * FROM `mappingjobposition` GROUP BY `kodeposisi`
---
    public function search($params)
    {
        $query = Mappingjobposition::find();
        // $query = Transrincianrekrut::find();
        $query->groupBy('jabatansap')->all();
        $query->groupBy('kodeposisi')->all();